## Leetcode Database exercise
[Comparison with sql](https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html)

627.[swap salary](https://leetcode.com/problems/swap-salary/description/)

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'id':np.arange(4), 'name':list('ABCD'), 'sex':['f', 'm']*2, 'salary': np.random.randint(1000,5000,4)})

In [5]:
df

   id name  salary sex
0   0    A    4961   f
1   1    B    1741   m
2   2    C    4788   f
3   3    D    2495   m

In [6]:
df['sex'] = df['sex'].map({'f':'m', 'm':'f'})

In [7]:
df

   id name  salary sex
0   0    A    4961   m
1   1    B    1741   f
2   2    C    4788   m
3   3    D    2495   f

In [9]:
df['sex'] = df['sex'].transform(lambda x: 'm' if x == 'f' else 'f')

In [10]:
df

   id name  salary sex
0   0    A    4961   f
1   1    B    1741   m
2   2    C    4788   f
3   3    D    2495   m

In [ ]:
# UPDATE salary
# SET sex = IF(sex='f','m','f');

176.Second Highest Salary

In [13]:
s = pd.Series(np.random.choice([1000, 2000, 3000], 10), name='salary')

In [23]:
unique_salary = sorted(s.unique(), reverse=True)

In [ ]:
# SELECT
#     IFNULL(
#       (SELECT DISTINCT Salary
#        FROM Employee
#        ORDER BY Salary DESC
#         LIMIT 1 OFFSET 1),
#     NULL) AS SecondHighestSalary

197.rising temperature

In [26]:
s = pd.Series(np.random.randint(20, 25, 5), index=pd.date_range('2018-01-01', freq='D',periods=5))

In [27]:
s

2018-01-01    20
2018-01-02    24
2018-01-03    23
2018-01-04    23
2018-01-05    21
Freq: D, dtype: int64

In [31]:
s[s.diff() > 0].index

DatetimeIndex(['2018-01-02'], dtype='datetime64[ns]', freq='D')

In [ ]:
# select a.Id from Weather a, Weather b 
# where a.Temperature > b.Temperature
# and DATEDIFF(a.RecordDate, b.RecordDate)=1

181.Employees Earning More Than Their Managers

In [32]:
df = pd.DataFrame({'Id':np.arange(1,5), 
                   'Name': list('ABCD'),
                   'Salary': [70000, 80000, 60000, 90000],
                   'ManagerId': [3,4,np.nan,np.nan]})

In [45]:
df

   Id  ManagerId Name  Salary
0   1        3.0    A   70000
1   2        4.0    B   80000
2   3        NaN    C   60000
3   4        NaN    D   90000

In [44]:
merged = df.merge(df, left_on='Id', right_on='ManagerId')
merged.loc[merged['Salary_y'] > merged['Salary_x'], 'Id_y']

0    1
Name: Id_y, dtype: object

In [ ]:
# select a.Name as Employee
# from Employee a, Employee b
# where a.ManagerId = b.Id and a.Salary > b.Salary

183.Customers Who Never Order

In [46]:
s1 = pd.DataFrame({'id':np.arange(1,5), 'customer': list('abcd')})
s2 = pd.Series([3,1])

In [48]:
s1.loc[~s1.id.isin(s2), 'customer']

1    b
3    d
Name: customer, dtype: object

In [ ]:
# select Name as Customers
# from Customers
# where Id not in (select CustomerId from Orders)

596.Classes More Than 5 Students

In [53]:
df = pd.DataFrame({'student': np.random.choice(list('ABCDEFGHIJKLMN'), 15),
                   'class': np.random.choice(['Math', 'English', 'Biology', 'Computer'], 15, p=[0.5, 0.3, 0.1, 0.1])})

In [57]:
class_ct = df.groupby('class')['student'].apply(lambda x: x.nunique()) 
class_ct[class_ct>4].index.tolist()

['Math']

In [ ]:
# select class
# from courses
# group by class
# having count(distinct student) > 4